 ### Terraform Component 🧱: `aws-analytical-platform-data-production-s3-glue-crawler`
#### Terraform Initialization ⚙️: `success`
#### Terraform Validation 🤖: `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Static Analysis 🛂

Checkov: `success`

tfsec: `success`

#### Terraform Plan 📖: `success`

<details><summary>Plan Output</summary>

```

Acquiring state lock. This may take a few moments...
data.aws_caller_identity.session: Reading...
data.aws_caller_identity.session: Read complete after 0s [id=042130406152]
data.aws_iam_session_context.session: Reading...
data.aws_iam_session_context.session: Read complete after 1s [id=arn:aws:sts::042130406152:assumed-role/GlobalGitHubActionAccess/GitHubActions]
data.aws_kms_key.rds_s3_export: Reading...
aws_glue_catalog_database.alpha_vcms_data: Refreshing state... [id=593291632749:alpha-vcms-data]
data.aws_iam_policy_document.glue_assume_policy: Reading...
data.aws_iam_policy_document.glue_assume_policy: Read complete after 0s [id=2205327684]
data.aws_kms_key.rds_s3_export: Read complete after 0s [id=2a571d42-b5e9-416a-9f59-843c4ed7e2e7]
data.aws_iam_policy_document.alpha_vcms_data_crawler_policy: Reading...
data.aws_iam_policy_document.alpha_vcms_data_crawler_policy: Read complete after 0s [id=2581791785]
aws_iam_policy.alpha_vcms_crawler: Refreshing state... [id=arn:aws:iam::593291632749:policy/alpha-vcms-crawler]
aws_iam_role.alpha_vcms_data_crawler: Refreshing state... [id=alpha-vcms-data-crawler]
aws_glue_crawler.alpha_vmcs_data: Refreshing state... [id=alpha-vcms-data]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_glue_catalog_database.alpha_vcms_data_2 will be created
  + resource "aws_glue_catalog_database" "alpha_vcms_data_2" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "alpha_vcms_data"
      + tags_all     = {
          + "application"            = "Data Platform"
          + "business-unit"          = "Platforms"
          + "component"              = "S3 Glue Crawler"
          + "environment"            = "production"
          + "infrastructure-support" = "data-platform:data-platform-tech@digital.justice.gov.uk"
          + "is-production"          = "true"
          + "owner"                  = "data-platform:data-platform-tech@digital.justice.gov.uk"
          + "source-code"            = "github.com/ministryofjustice/data-platform/terraform/aws/analytical-platform-data-production/s3-glue-crawler"
        }
    }

  # aws_glue_crawler.alpha_vmcs_data_2 will be created
  + resource "aws_glue_crawler" "alpha_vmcs_data_2" {
      + arn           = (known after apply)
      + configuration = jsonencode(
            {
              + CrawlerOutput = {
                  + Partitions = {
                      + AddOrUpdateBehavior = "InheritFromTable"
                    }
                }
              + Version       = 1
            }
        )
      + database_name = "alpha_vcms_data"
      + id            = (known after apply)
      + name          = "alpha-vcms-data_2"
      + role          = "arn:aws:iam::593291632749:role/alpha-vcms-data-crawler"
      + tags_all      = {
          + "application"            = "Data Platform"
          + "business-unit"          = "Platforms"
          + "component"              = "S3 Glue Crawler"
          + "environment"            = "production"
          + "infrastructure-support" = "data-platform:data-platform-tech@digital.justice.gov.uk"
          + "is-production"          = "true"
          + "owner"                  = "data-platform:data-platform-tech@digital.justice.gov.uk"
          + "source-code"            = "github.com/ministryofjustice/data-platform/terraform/aws/analytical-platform-data-production/s3-glue-crawler"
        }

      + s3_target {
          + path = "s3://alpha-vcms-data/vcms-data-3/vcms/"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @lalithanagarur, Action: `pull_request`, Working Directory: `terraform/aws/analytical-platform-data-production/s3-glue-crawler`, Workflow: `Terraform`*